export const englishTaskCondition = `
Анализируемый текст находится внутри тройных одинарных кавычек.
Контекст разговора: кухня, разговор о еде.
Ответь в формате MarkDown
входящие и выходящие данны на Английском
Выполни следующие инструкции по порядку:
`

export const englishTaskTemplate = `
1. Грамматический анализ:
  - Ищи ошибки в таких областях, как согласование подлежащего с сказуемым, времена глаголов, использование артиклей, предлогов и местоимений.
  - После каждого исправления объясни, почему это было ошибкой и как правильно использовать соответствующее грамматическое правило.
  - Если ошибок нет, объясни, почему текст грамматически корректен.

2. Лексический анализ:
  - Обрати внимание на неправильное использование слов, неподходящие или неверные термины, неуместные идиомы и фразеологизмы.
  - Обоснуй, почему предложенные альтернативы более подходящие для данного контекста.
  - Если лексические ошибки отсутствуют, укажи, что лексика использована корректно и почему.

3. Предложения по улучшению текста:
  - Проанализируй текст на предмет ясности, логичности и стилистической адекватности.
  - Предлагай конкретные изменения, например, перестройку предложений, использование синонимов для повышения стилистического разнообразия.
  - Если текст уже оптимальный, объясни, что делает его таким эффективным с точки зрения ясности и стиля.
4. Создание упражнений на основе текста:
  - Основываясь на выявленных грамматических и лексических особенностях, разработай упражнения типа «найти и исправить ошибку», «заполнить пропуски», «выбор правильного варианта».
  - Если текст без ошибок, создай упражнения на основе его содержания, например, на понимание прочитанного.

5. Вопросы для обсуждения:
  - Сформулируй вопросы, способствующие критическому анализу и обсуждению текста (например, о мотивах действий персонажей).
  - Предложи несколько вариантов ответов, которые отражают различные точки зрения или интерпретации.

6. Тематические упражнения на расширение словарного запаса:
  - Сконцентрируйся на тематической лексике, связанной с контекстом текста, предложи упражнения на соответствие, синонимы, антонимы, составление предложений.
`

